---
kind: property
id: P:Autodesk.Revit.DB.Lighting.RectangleLightShape.EmitWidth
source: html/ae514118-e9c0-ee49-68f6-891a50b42ebd.htm
---
# Autodesk.Revit.DB.Lighting.RectangleLightShape.EmitWidth Property

The emit width.

## Syntax (C#)
```csharp
public double EmitWidth { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The shape dimension is not valid because it is not between 1.0e-9 and 30000.0.